# <center>  Working With Dataframes </center>
<div>
<img src="https://pandas.pydata.org/static/img/pandas.svg" width="600"/>
</div>

In the last lecture, we were introduced to the `pandas` library, which gives us the ability to work with two new data types: dataframes and series. In this lecture, we will learn more about how to use and work with dataframes.

We're going to talk about some ways to handle and work with dataframes, which includes basic selection and deletion of columns, renaming columns, etc. Then, we'll go a bit into subsetting data using various selection methods. Finally, we talk about some methods for dataframes that will be useful for data organization, manipulation and analysis.

## Handling Dataframes

To learn how to use dataframes to their fullest capacity, we first need to know how to handle them. First, let's import pandas and numpy.

In [1]:
import pandas as pd
import numpy as np

In [2]:
sales = pd.read_csv('../datasets/sales.csv')
sales.head(3)

,Row ID,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Customer Name,Segment,Country,City,State,Postal Code,Region,Product ID,Category,Sub-Category,Product Name,Sales
0,1,CA-2017-152156,8/11/17,11/11/17,2,CG-12520,Claire Gute,Consumer,United States,Henderson,Kentucky,42420.0,South,FUR-BO-10001798,Furniture,Bookcases,Bush Somerset Collection Bookcase,261.96
1,2,CA-2017-152156,8/11/17,11/11/17,2,CG-12520,Claire Gute,Consumer,United States,Henderson,Kentucky,42420.0,South,FUR-CH-10000454,Furniture,Chairs,"Hon Deluxe Fabric Upholstered Stacking Chairs,...",731.94
2,3,CA-2017-138688,12/6/17,16/06/2017,2,DV-13045,Darrin Van Huff,Corporate,United States,Los Angeles,California,90036.0,West,OFF-LA-10000240,Office Supplies,Labels,Self-Adhesive Address Labels for Typewriters b...,14.62

This is a dataset of sales from a retail store over 4 years. At a quick glance, we can see the type of data collected. We have some IDs in the form of alphanumerical data, some dates, names, locations, etc.

In getting acquainted with our data, we may want to quickly know how many entries there are and how many attributes are measured per entry:

In [ ]:
print(sales.shape)

Recall that dataframes are made of concatanated series in the form of columns. To extract one column from a dataframe, we call for the dataframe and then close the name of the column (as a string) in single square brackets or double square brackets:

In [ ]:
sales['Segment']

In [ ]:
sales[['Segment']]

**What do notice about the difference in extracting a column with single square brackets versus double square brackets?**

Notice that using single square brackets returns a series, while the use of double square brackets return a one-column dataframe. This is important, as it can dictate how the output can be used, as well as what functions and methods can be used on it.

For example, if we wanted to get the first item of the `Segment` column, we could use `sales['Segment'][0]` with a series, but not with a dataframe:

In [ ]:
sales['Segment'][0]

In [ ]:
sales[['Segment']][0]

However, if you wanted to select multiple columns at once, that can be done with a dataframe, but not a series:

In [ ]:
sales[['Segment', 'Ship Mode']]

In [ ]:
sales['Segment', 'Ship Mode']

We can also extract a dataframe column by using a `dataframe.column_name` notation. This is best to use when there are no spaces in the column name. A series will be returned by using this notation, similar to `dataframe['column_name']`:

In [ ]:
sales.Segment

It is also useful to rename columns in a dataframe using the `.rename()` method. Calling this method on a dataframe, you can easily rename a column by passing a dictionary with the keys being the current column name and the values being the desired column name:

In [ ]:
sales = sales.rename(columns={'Postal Code':'Zip Code', 'Ship Mode':'Shipping Method'})
sales.head(3)

New columns can be added to dataframes as well. If you wish to add a column based on other columns that already exist in the dataframe, you can perform operations on the columns and assign them to the new desired column. Here, we make a new column called `Full Location` that combines data from the `City` and `State` columns, separated by a comma:

In [ ]:
sales['Full Location'] = sales['City'] + ', ' + sales['State']
sales.head(3)

If desired, you can also create an empty column:

In [ ]:
sales['Empty'] = ""
sales.head(3)

There may be times where you want to delete columns. This can be accomplished using the `.drop()` method. When you call this method on a dataframe, you can pass a single column name or a list of column names to the `columns` parameter. The `inplace=True` parameter updates the dataframe.

In [ ]:
sales.drop(columns=['Country', 'Empty'], inplace=True)
sales.head(3)

Notice that we utilized two ways of updating dataframes using these methods. One way was to use the method on the dataframe and reassign the output of that to the name of the dataframe (as we did when using the `.rename()` method).The other way was by specifying the `inplace` parameter as `True` (as we did with the `.drop()` method). 

Both of these ways are fine, but be mindful that not all methods and functions have an `inplace` parameter. Therefore, it's always a good idea to refer to the documentation of a function or method to understand how it can be used.

## Subsetting data in dataframes

Being able to parse and subset data intentionally is important for downstream data analysis. When consecutive rows of data need to be extracted, dataframes can be sliced similar to lists and arrays. To extract the first 50 rows of `sales` we could slice the dataframe as follows:

In [ ]:
top50 = sales[0:50]
print('Number of rows in top50:', len(top50))
top50.head(3)

Likewise we can extract intervals of rows using double colons:

In [ ]:
even_rows = sales[0::2]
print('Selecting every other column gives us a dataframe of', len(even_rows), 'rows.')

even_rows.head(3)

To exact all rows and a specific column, we can use the `.iloc[]` method. The `.iloc[]` method uses integer-location based indexing for selection of rows and columns by position. To select all rows and the `Ship Date` column (which has an index of 3), we can type the following code:

In [ ]:
sales.iloc[:, 3]

Vice versa, we can select the data corresponding to all columns of the fourth row (which has an index of 3).

In [ ]:
sales.iloc[3, :]

Using `.iloc[]` we can specifically select cells of a dataframe by inputting its row and column index values:

In [ ]:
sales.iloc[234, 9]

Similar to slicing, we can also select specific indexes or a range of consecutive indexes:

In [ ]:
sales.iloc[0:500, [3,6,12]]

**What do you think this code does? Discuss with your neighbor for approximately one minute.**

In [ ]:
rows = np.arange(45,107, step = 5)

sales.iloc[rows, 13:]

**What do you think this does? Discuss with your neighbor for approximately one minute.**

In [ ]:
sales.iloc[2999:3872:100, 4::3]

Another way to extract data from dataframes is using the `.loc[]` method. The `.loc[]` method utilizes labels or boolean arrays to select data. While specifying the indices of a list of rows you wish to select, you can utilize the name of a column to extract data of interest, as shown below:

In [ ]:
sales.loc[[22,485,1008], "Category"]

Moreover, you can select multiple columns by passing a list into the `.loc[]` method:

In [ ]:
sales.loc[[22,485,1008], ["Category", "Sub-Category", "Shipping Method"]]

The `.loc[]` method is a really powerful selection method that can be used to extract data based on conditions. Here, we select all rows where the `Region` column equates to `West`:

In [ ]:
west = sales.loc[(sales['Region'] == 'West')]
west.head(3)

We can also compound conditions using bitwise operators. We can select rows that meet one of multiple conditions by using the `|` operator:

In [ ]:
w_florida = sales.loc[(sales['Region'] == 'West') | (sales['State'] == 'Florida')]
w_florida.head(3)

If we want rows that meet <u>all</u> of our conditions of interests, we can use the `&` operator:

In [ ]:
ny_low = sales.loc[(sales['State'] == 'New York') & (sales['Sales'] < 100)]
ny_low.head(3)

As shown before, we don't have to return all columns of the dataframe when selecting based on condition. We can return only the columns of interest by passing the names of these columns as a list into the `.loc[]` method:

In [ ]:
dvh = sales.loc[(sales['Customer Name'] == 'Darrin Van Huff'), ['Order Date', 'Customer Name', 'Category']]
dvh

Using a combination of index-based and label-based location, the `.loc[]` method also allows us to select specific cells of interest. By doing so, we can change data in our dataframe as needed:

In [ ]:
sales.loc[0, ['Ship Date']]

In [ ]:
sales.loc[0, ['Ship Date']] = '11/13/2017'
sales.head(3)

Finally, we can use `.loc[]` to insert rows in specific positions. If we want to insert a row between index 9802 and 9803, can set an index at some number in between (i.e. 9798.5) and add data using a dictionary. The key of the dictionary corresponds to the name of the column and the value corresponds to the data added in that column for the row:

In [ ]:
sales.loc[9802.5] = {'Order ID': 'KB-2023-1849274', 'Order Date':'05/22/2023', "Customer Name": "Kewon Bell", 
                     "Region":"Central", "City":"Chicago", "State":"Illinois"}
sales.tail()

Notice that for the columns that we did not specify, NaN was used. NaN stands for "Not a Number", which is used as a placeholder since we did not have any data for these columns. 

Now that we have our data added to the end of our dataframe, we can sort the indexes by using the `.sort_index()` method. When we call this method on our dataframe, we can set the `ascending` parameter equal to `False` to have our indexes go from largest to smallest. We can then set `inplace` equal to `True` so that it updates the dataframe without reassignment:

In [ ]:
sales.sort_index(ascending=False, inplace=True)
sales.head(3)

The new row has been placed in between the 9803 index and 9802 index. This is the desired location that we wanted, however, we do not want an index as a float. To fix this, we can simply reset our indexes using `.reset_index()`. By setting `drop=True`, we get rid of the column that was once the index:

In [ ]:
sales.reset_index(drop=True, inplace=True)
sales.head(3)

Our dataframe has now been sorted and reset. All of the rows that were at the end are now at the beginning.

But say we made a mistake and we wanted to remove that row again, we could use the `.drop()` method again, but this time, use the `index` parameter and set it to the index of the row we want to remove. To update the dataframe you can use reassignment or set `inplace=True`:

In [ ]:
sales.drop(index=1, inplace=True)
sales.head(3)

So now we have the row we wanted removed, but we should still like to fix our `Row ID` column to make them integers again. We can do this using a method called `.astype()`. This method can be used to change the data type of a dataframe or series.

In [ ]:
sales['Row ID'] = sales['Row ID'].astype(int)
sales.head(3)

Finally, we can set the indexes of our dataframe to any column within the dataframe by using `.set_index()`. The `.set_index()` method can be used to set unique identifiers, such as a user ID or social security number, as this index, which could be very useful for label-based selection.

For now, we will use the `Row ID` column to set our indexes.

In [ ]:
sales.set_index('Row ID', inplace=True)
sales.tail(3)

### <code style="background:#83ebd5;color:black">Exercise:</code>

- The `Zip Code` column of `sales`, for some odd reason, is recorded as floats. Convert this column to integers.

- From `sales`, select all entries from Southwestern states (Arizona, New Mexico, Texas, Oklahoma) that ordered products from the `Art` sub-category. Assign this dataframe as `southwest`. *Hint: this may require an intermediate step.*

- From `sales`, select the `Customer ID`, `Customer Name`, `Segment`, and `Sales` columns. Assign this dataframe as `customers`. Then, set the index of `customers` to be the `Customer ID` column. Using the index, select orders with the customer ID <u>SH-19975</u>. *Hint: refer to the `pandas.DataFrame.loc` online documentation if you get stuck.*

In [3]:
#Answer: The southwest dataframe

#Subset the rows from southwestern states
southwest = sales.loc[(sales['State'] == 'New Mexico') | (sales['State'] == 'Arizona') | (sales['State'] == 'Texas') | 
                      (sales['State'] == 'Oklahhoma')]

#Subset the rows where the sub-category is art
southwest = southwest.loc[(southwest['Sub-Category'] == 'Art')]

southwest

,Row ID,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Customer Name,Segment,Country,City,State,Postal Code,Region,Product ID,Category,Sub-Category,Product Name,Sales
67,68,CA-2015-106376,5/12/15,10/12/15,3,BS-11590,Brendan Sweed,Corporate,United States,Gilbert,Arizona,85234.0,West,OFF-AR-10002671,Office Supplies,Art,Hunt BOSTON Model 1606 High-Volume Electric Pe...,1113.024
164,165,CA-2015-139892,8/9/15,12/9/15,3,BM-11140,Becky Martin,Consumer,United States,San Antonio,Texas,78207.0,Central,OFF-AR-10004441,Office Supplies,Art,BIC Brite Liner Highlighters,9.936
168,169,CA-2015-139892,8/9/15,12/9/15,3,BM-11140,Becky Martin,Consumer,United States,San Antonio,Texas,78207.0,Central,OFF-AR-10002656,Office Supplies,Art,Sanford Liquid Accent Highlighters,32.064
374,375,US-2015-119137,23/07/2015,27/07/2015,3,AG-10900,Arthur Gainer,Consumer,United States,Tucson,Arizona,85705.0,West,OFF-AR-10000658,Office Supplies,Art,Newell 324,9.240
428,429,CA-2018-152275,1/10/18,8/10/18,3,KH-16630,Ken Heidel,Corporate,United States,San Antonio,Texas,78207.0,Central,OFF-AR-10000369,Office Supplies,Art,Design Ebony Sketching Pencil,6.672
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
9302,9299,US-2016-163433,18/04/2016,22/04/2016,2,MP-17965,Michael Paige,Corporate,United States,Mcallen,Texas,78501.0,Central,OFF-AR-10003373,Office Supplies,Art,"Boston School Pro Electric Pencil Sharpener, 1670",74.352
9306,9303,US-2016-163433,18/04/2016,22/04/2016,2,MP-17965,Michael Paige,Corporate,United States,Mcallen,Texas,78501.0,Central,OFF-AR-10003481,Office Supplies,Art,Newell 348,7.872
9309,9306,CA-2016-137603,19/09/2016,24/09/2016,3,MH-17290,Marc Harrigan,Home Office,United States,Santa Fe,New Mexico,87505.0,West,OFF-AR-10001972,Office Supplies,Art,Newell 323,8.400
9316,9313,CA-2018-148642,6/3/18,12/3/18,3,DW-13540,Don Weiss,Consumer,United States,Dallas,Texas,75220.0,Central,OFF-AR-10000588,Office Supplies,Art,Newell 345,63.488
9438,9435,CA-2016-119627,17/08/2016,23/08/2016,3,SC-20725,Steven Cartwright,Consumer,United States,Peoria,Arizona,85345.0,West,OFF-AR-10000203,Office Supplies,Art,Newell 336,10.272

In [14]:
#Answer: The customer dataframe

#Extract the desired columns
customers = sales[['Customer ID', 'Customer Name', 'Segment', 'Sales']]

#Set the index to the Customer Name column
customers = customers.set_index('Customer ID')

#Select the inddexes with the customer ID SH-19975
customers.loc['SH-19975']

             Customer Name    Segment     Sales
Customer ID
SH-19975     Sally Hughsby  Corporate    8.8200
SH-19975     Sally Hughsby  Corporate   10.8600
SH-19975     Sally Hughsby  Corporate  143.7000
SH-19975     Sally Hughsby  Corporate  424.9575
SH-19975     Sally Hughsby  Corporate   13.3920
SH-19975     Sally Hughsby  Corporate   11.2280
SH-19975     Sally Hughsby  Corporate   40.7760
SH-19975     Sally Hughsby  Corporate   63.9360
SH-19975     Sally Hughsby  Corporate   18.7200
SH-19975     Sally Hughsby  Corporate   20.3680
SH-19975     Sally Hughsby  Corporate   49.8480
SH-19975     Sally Hughsby  Corporate   67.7800
SH-19975     Sally Hughsby  Corporate   15.8400
SH-19975     Sally Hughsby  Corporate    8.4480
SH-19975     Sally Hughsby  Corporate  338.3520
SH-19975     Sally Hughsby  Corporate   25.9200
SH-19975     Sally Hughsby  Corporate   91.3600
SH-19975     Sally Hughsby  Corporate  307.1360
SH-19975     Sally Hughsby  Corporate   12.6000
SH-19975     Sally Hughsby  Corporate  159.9800
SH-19975     Sally Hughsby  Corporate   15.9200
SH-19975     Sally Hughsby  Corporate   70.6800
SH-19975     Sally Hughsby  Corporate  541.2400
SH-19975     Sally Hughsby  Corporate    3.7980

## Organizing, manipulating, analyzing data in dataframes

There are many functions and methods that can assist with organizing, manipulating, and analyzing data in dataframes. We will discuss several important ones to remember.

The first method we will discuss is the `.sort_values()` method. This is a useful method for looking at trends or sequential values in a dataset. The `.sort_values()` method has an `ascending` parameter, which is set to `True` by default. It also has an `inplace` parameter, which is set to `False` by default:

In [ ]:
sales.sort_values('City', inplace= True)
sales.head(3)

Another useful method is the 
`.value_counts()` method. This method can be used on a series to count the number of occurences for each unique value in the series. Let's use this method to determine how many shipments were shipped to each region:

In [ ]:
sales['Region'].value_counts()

There are a number of statistical and summative methods that can be used on dataframes as well. For example, the `.min()` and `.max()` methods can be used on a a dataframe or a column within a dataframe to determine the minimum and maximum values, respectively. The `.describe()` method returns multiple useful summary statistics:

In [ ]:
sales['Sales'].min()

In [ ]:
sales['Sales'].max()

In [ ]:
sales['Sales'].describe()

Here's a short list of methods that can be used to determine summative information and/or statistics:

`.min()` - determines the minimum value in a dataframe/series

`.max()` - determines the maximum value in a dataframe/series

`.mean()` - determines the mean value of a dataframe/series

`.median()` - determines the median value in a dataframe/series

`.sum()` - determines the sum of the values in a dataframe/series

`.mode()` - determines the mode of a dataframe/series

`.nlargest()` - determines the largest *n* items in a series. (Default = 5)

`.nsmallest()` - determines the smallest *n* items in a series. (Default = 5)

`.count()` - counts all non-null items in a dataframe/series

`.value_counts` - counts the number of times an item occurs in a dataframe/series

`.nunique()` - counts the number of unique items in a dataframe/series

`.unique()` - lists all of the unique items in a dataframe/series

`.describe` - generates descriptive statistics of a dataframe column, including those that summarize the central tendency, dispersion and shape of a datasetâ€™s distribution, excluding null values (NaN).

Sometimes when working with data, especially data generated by human input, we encounter errors within the data. One useful tool that can be used to find mistakes is the `.duplicated()` method. This method shows duplicated rows within a dataframe, like so:

In [ ]:
sales[sales.duplicated()]

When `.duplicated()` is called on a dataframe, another dataframe containing the rows of the duplicated entries is returned to us. We can easily get rid of these duplicated rows by calling `.drop_duplicates()` on the dataframe:

In [ ]:
print(sales.shape)
sales = sales.drop_duplicates()
print(sales.shape)

We see that prior to dropping the duplicates, `sales` had 9804 rows. After dropping the duplicates, there are now 9799 rows, 5 less than before. This is the number of rows that were determined to be duplicated in `sales`, as shown above.

We can also correct typos observed in dataframes. Say for example, we had a customer listed in our dataframe as Eric Hoffmann. We can extract all the rows pertaining to this customer:

In [ ]:
sales.loc[(sales['Customer Name']) == 'Eric Hoffmann'].head(3)

Say an extra 'n' was accidentally added to Eric's last name. We can correct this typo in all of these cells by using the `.replace()` method. When using the `.replace()` method, we can call the current mispelling into the `to_replace` parameter. We can then call the correct spelling into the `value` parameter. The `inplace` parameter will update our dataframe in real time. 

If we try to extract rows with the original spelling, we get an empty dataframe returned to us:

In [ ]:
sales["Customer Name"].replace(to_replace='Eric Hoffmann', value='Eric Hoffman', inplace=True)

sales.loc[(sales['Customer Name']) == 'Eric Hoffmann'].head(3)

If we use the new spelling, we can see that the name has been updated:

In [ ]:
sales.loc[(sales['Customer Name']) == 'Eric Hoffman'].head(3)

We can also apply string methods to columns in a dataframe and update the column through variable assignment:

In [ ]:
sales['State'] = sales['State'].str.upper()
sales.head(3)

Another useful method is the `.map()` method. The `.map()` method substitutes values from a series, dictionary, or function based on current values in the dataframe. Using this method, we can map the values in the `Shipping Method` column to their corresponding string values like so:

In [ ]:
new_vals = {0: 'Same Day', 1: 'First Class', 2:'Second Class', 3:'Standard Class'}

sales['Shipping Method'] = sales['Shipping Method'].map(new_vals)
sales.head()

Applying values and functions en masse to datasets is a quick and easy way to analyze and modify data. The `.applymap()` method is great for this because uses a function and applies it to an entire dataframe. Say we wanted to convert all the data in sales to string data, we would do:

In [ ]:
strings = sales.applymap(str)
strings.head(3)

By eye, `strings` looks the same as `sales`, but upon closer investigation, we can see that the numbers have been converted to strings:

In [ ]:
strings['Zip Code'][5] #Picking a random number from the Zip Code column

In [ ]:
print(type(strings['Zip Code'][5]))

The `.apply()` method is also great for applying a function to a series or multiple columns within a dataframe across an axis (i.e. across rows or across columns). For example, if we wanted to count the characters in each state for each row, we could apply the `len` function:

In [ ]:
sales['State'].apply(len)

When using the`.apply()` method on multiple columns of a dataframe, the`axis` parameter dictates if you function is applied acrossed rows or columns. When `axis=0`, the function is applied across columns, and when `axis=1`, the function is applied across rows.

<img src="https://raw.githubusercontent.com/campbelle1/CAN2023/4c78054e6a24add10344d95ab609c1ecba3d6999/apply-method.png" width="600"/>

Apply can be useful for aggregate functions, such as `np.min`, `np.max`, `np.mean`, and `np.sum`. For more information, refer to the `.apply()` method documentaion in the `pandas`. You will see other applications of `.apply()` when learning how to make user-defined functions.

# Activity

A study including 1040 subjects examines the effects of a weight loss medication. The study records subject demographics, such as age and sex, as well as each subject's weight for seven days. Each subject was assigned a unique identification number.

- Load the data from the provided internet URL. Assign this data to a dataframe called `study`.

- The downloaded data file did not include data from the last two subjects. Using the following information, append this data to `study`:
<img align="center" src="https://raw.githubusercontent.com/campbelle1/CAN2023/161d2a06dfe210825ea764fb65d0c5cfdcdd51a7/Extras.png" width="20%"/> 

- From `study`, determine the minimum and maxmimum weights for each subject within the seven day period of the experiment. Append this information as new columns called `Min Weight` and `Max Weight` in the `study` dataframe.

- Find the net weight change from the beginning of the experiment to the end of the experiment for each subject.

- For the ease of data collection, treatments for the study were recorded as 0 (to mean the subject received the placebo) or 1 (to mean the subject received the weight loss medication). Replace these integers with the description of the treatment (that is, *Placebo* or *Medication*).

- Researchers have seen anecdotally that older subjects seem to lose more weight than younger subjects. Determine the top 10% of subjects that had the most weight loss. Calculate the proportion of subjects in the top 10% that were over the age of 35.

In [15]:
#Load Data

study = pd.read_csv('https://tinyurl.com/weight-loss-experiment-CAN2023')
study

,IDs,Sex,Age,Treatment,Day 1,Day 2,Day 3,Day 4,Day 5,Day 6,Day 7
0,34681,M,27,0,184.6,183.9,188.7,182.7,181.8,179.3,179.2
1,35912,M,49,1,188.6,188.1,186.6,180.2,178.3,177.3,177.9
2,35354,M,29,0,140.4,141.3,136.8,131.4,130.1,130.0,130.0
3,35482,M,30,0,298.5,299.6,298.5,292.8,288.3,289.9,293.0
4,35317,M,29,1,136.4,136.0,138.0,134.2,138.1,135.4,139.4
...,...,...,...,...,...,...,...,...,...,...,...
1033,35816,M,40,0,142.2,142.8,139.0,136.0,132.9,130.8,131.6
1034,35784,F,30,0,280.9,280.7,277.0,276.3,276.1,276.2,275.6
1035,35762,F,41,1,198.2,199.3,199.0,193.3,191.3,188.7,192.6
1036,34886,F,45,0,267.2,267.2,269.1,270.1,271.6,272.2,271.6
1037,35496,M,46,1,271.0,272.2,270.9,264.7,267.3,265.0,265.4

In [28]:
# Add extra data
extra = pd.DataFrame({'IDs':[34605,36044] , 'Sex':['F', 'F'], 'Age':[28, 32], 'Treatment':[0, 1],
                      'Day 1':[120.5, 142.3], 'Day 2':[120.7, 140.5], 'Day 3':[121.3, 140.1],
                   'Day 4':[120.1, 139.2], 'Day 5':[119.4, 137.9], 'Day 6':[117.2, 137.3], 'Day 7':[116.6, 136.8]})
extra
study = pd.concat([study,extra], axis=0)
study

,IDs,Sex,Age,Treatment,Day 1,Day 2,Day 3,Day 4,Day 5,Day 6,Day 7
0,34681,M,27,0,184.6,183.9,188.7,182.7,181.8,179.3,179.2
1,35912,M,49,1,188.6,188.1,186.6,180.2,178.3,177.3,177.9
2,35354,M,29,0,140.4,141.3,136.8,131.4,130.1,130.0,130.0
3,35482,M,30,0,298.5,299.6,298.5,292.8,288.3,289.9,293.0
4,35317,M,29,1,136.4,136.0,138.0,134.2,138.1,135.4,139.4
...,...,...,...,...,...,...,...,...,...,...,...
1035,35762,F,41,1,198.2,199.3,199.0,193.3,191.3,188.7,192.6
1036,34886,F,45,0,267.2,267.2,269.1,270.1,271.6,272.2,271.6
1037,35496,M,46,1,271.0,272.2,270.9,264.7,267.3,265.0,265.4
0,34605,F,28,0,120.5,120.7,121.3,120.1,119.4,117.2,116.6
1,36044,F,32,1,142.3,140.5,140.1,139.2,137.9,137.3,136.8

In [29]:
#Find minimum value throughout experiment

study['Min'] = study.iloc[:,4:11].apply(np.min, axis=1)
study

,IDs,Sex,Age,Treatment,Day 1,Day 2,Day 3,Day 4,Day 5,Day 6,Day 7,Min
0,34681,M,27,0,184.6,183.9,188.7,182.7,181.8,179.3,179.2,179.2
1,35912,M,49,1,188.6,188.1,186.6,180.2,178.3,177.3,177.9,177.3
2,35354,M,29,0,140.4,141.3,136.8,131.4,130.1,130.0,130.0,130.0
3,35482,M,30,0,298.5,299.6,298.5,292.8,288.3,289.9,293.0,288.3
4,35317,M,29,1,136.4,136.0,138.0,134.2,138.1,135.4,139.4,134.2
...,...,...,...,...,...,...,...,...,...,...,...,...
1035,35762,F,41,1,198.2,199.3,199.0,193.3,191.3,188.7,192.6,188.7
1036,34886,F,45,0,267.2,267.2,269.1,270.1,271.6,272.2,271.6,267.2
1037,35496,M,46,1,271.0,272.2,270.9,264.7,267.3,265.0,265.4,264.7
0,34605,F,28,0,120.5,120.7,121.3,120.1,119.4,117.2,116.6,116.6
1,36044,F,32,1,142.3,140.5,140.1,139.2,137.9,137.3,136.8,136.8

In [30]:
#Find maximum value throughout experiment

study['Max'] = study.iloc[:,4:11].apply(np.max, axis=1)
study

,IDs,Sex,Age,Treatment,Day 1,Day 2,Day 3,Day 4,Day 5,Day 6,Day 7,Min,Max
0,34681,M,27,0,184.6,183.9,188.7,182.7,181.8,179.3,179.2,179.2,188.7
1,35912,M,49,1,188.6,188.1,186.6,180.2,178.3,177.3,177.9,177.3,188.6
2,35354,M,29,0,140.4,141.3,136.8,131.4,130.1,130.0,130.0,130.0,141.3
3,35482,M,30,0,298.5,299.6,298.5,292.8,288.3,289.9,293.0,288.3,299.6
4,35317,M,29,1,136.4,136.0,138.0,134.2,138.1,135.4,139.4,134.2,139.4
...,...,...,...,...,...,...,...,...,...,...,...,...,...
1035,35762,F,41,1,198.2,199.3,199.0,193.3,191.3,188.7,192.6,188.7,199.3
1036,34886,F,45,0,267.2,267.2,269.1,270.1,271.6,272.2,271.6,267.2,272.2
1037,35496,M,46,1,271.0,272.2,270.9,264.7,267.3,265.0,265.4,264.7,272.2
0,34605,F,28,0,120.5,120.7,121.3,120.1,119.4,117.2,116.6,116.6,121.3
1,36044,F,32,1,142.3,140.5,140.1,139.2,137.9,137.3,136.8,136.8,142.3

In [31]:
#Find the next change from beginning of experiment to the end

study['Net Change'] = study['Day 1'] - study['Day 7']
study

,IDs,Sex,Age,Treatment,Day 1,Day 2,Day 3,Day 4,Day 5,Day 6,Day 7,Min,Max,Net Change
0,34681,M,27,0,184.6,183.9,188.7,182.7,181.8,179.3,179.2,179.2,188.7,5.4
1,35912,M,49,1,188.6,188.1,186.6,180.2,178.3,177.3,177.9,177.3,188.6,10.7
2,35354,M,29,0,140.4,141.3,136.8,131.4,130.1,130.0,130.0,130.0,141.3,10.4
3,35482,M,30,0,298.5,299.6,298.5,292.8,288.3,289.9,293.0,288.3,299.6,5.5
4,35317,M,29,1,136.4,136.0,138.0,134.2,138.1,135.4,139.4,134.2,139.4,-3.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1035,35762,F,41,1,198.2,199.3,199.0,193.3,191.3,188.7,192.6,188.7,199.3,5.6
1036,34886,F,45,0,267.2,267.2,269.1,270.1,271.6,272.2,271.6,267.2,272.2,-4.4
1037,35496,M,46,1,271.0,272.2,270.9,264.7,267.3,265.0,265.4,264.7,272.2,5.6
0,34605,F,28,0,120.5,120.7,121.3,120.1,119.4,117.2,116.6,116.6,121.3,3.9
1,36044,F,32,1,142.3,140.5,140.1,139.2,137.9,137.3,136.8,136.8,142.3,5.5

In [32]:
#Map treatment values to words

study['Treatment'] = study['Treatment'].map({0:'Placebo', 1:'Medication'})
study

,IDs,Sex,Age,Treatment,Day 1,Day 2,Day 3,Day 4,Day 5,Day 6,Day 7,Min,Max,Net Change
0,34681,M,27,Placebo,184.6,183.9,188.7,182.7,181.8,179.3,179.2,179.2,188.7,5.4
1,35912,M,49,Medication,188.6,188.1,186.6,180.2,178.3,177.3,177.9,177.3,188.6,10.7
2,35354,M,29,Placebo,140.4,141.3,136.8,131.4,130.1,130.0,130.0,130.0,141.3,10.4
3,35482,M,30,Placebo,298.5,299.6,298.5,292.8,288.3,289.9,293.0,288.3,299.6,5.5
4,35317,M,29,Medication,136.4,136.0,138.0,134.2,138.1,135.4,139.4,134.2,139.4,-3.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1035,35762,F,41,Medication,198.2,199.3,199.0,193.3,191.3,188.7,192.6,188.7,199.3,5.6
1036,34886,F,45,Placebo,267.2,267.2,269.1,270.1,271.6,272.2,271.6,267.2,272.2,-4.4
1037,35496,M,46,Medication,271.0,272.2,270.9,264.7,267.3,265.0,265.4,264.7,272.2,5.6
0,34605,F,28,Placebo,120.5,120.7,121.3,120.1,119.4,117.2,116.6,116.6,121.3,3.9
1,36044,F,32,Medication,142.3,140.5,140.1,139.2,137.9,137.3,136.8,136.8,142.3,5.5

In [33]:
#Find the subjects with the top weight loss throughout the experiment

print('Top 10 = ', 1040 * 0.1)
top104 = study.sort_values('Net Change', ascending=True)
top104.iloc[:104, :]

Top 10 =  104.0

,IDs,Sex,Age,Treatment,Day 1,Day 2,Day 3,Day 4,Day 5,Day 6,Day 7,Min,Max,Net Change
595,34860,F,42,Placebo,196.0,196.1,200.6,201.9,205.7,208.2,210.6,196.0,210.6,-14.6
174,35120,F,34,Medication,183.1,183.2,189.1,189.3,192.2,193.0,196.4,183.1,196.4,-13.3
988,34825,F,37,Placebo,240.4,241.4,246.3,246.9,250.3,249.4,253.3,240.4,253.3,-12.9
819,35874,M,51,Placebo,243.2,244.2,249.2,248.6,251.9,253.1,256.0,243.2,256.0,-12.8
797,35495,F,45,Medication,97.4,97.8,101.0,102.0,105.3,107.3,109.7,97.4,109.7,-12.3
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
39,35984,F,29,Placebo,243.0,243.2,244.1,244.4,246.2,245.5,248.9,243.0,248.9,-5.9
786,35617,M,48,Medication,126.7,127.2,129.0,128.6,132.5,133.9,132.6,126.7,133.9,-5.9
731,35325,M,45,Placebo,104.7,104.9,109.3,106.6,108.6,107.7,110.6,104.7,110.6,-5.9
860,35395,F,36,Medication,286.3,286.4,289.3,290.0,291.2,292.2,292.1,286.3,292.2,-5.8
528,35217,M,45,Medication,226.1,226.0,232.3,231.3,232.8,233.5,231.9,226.0,233.5,-5.8

In [34]:
#Find the proportion of people in the top 10% that are above the age 35

len(top104.loc[(top104['Age'] > 35)])/len(top104)

0.6067307692307692